# Data Engineering: Lab 05
---------------

In [30]:
import pandas as pd

### Task 01: Read the customers.

##### a) Create a DataFrame called customers with the customers.csv file. Print the count of customers and 5 entries to have a look at the data.

In [31]:
customers = pd.read_csv('DE_Lab05_customers.csv', delimiter = ',')

customers.head()

   id                name  status                bdate        city canton
0   1        Lesia Joiner  silver  1985-07-11 21:56:26     Buelach   todo
1   2        Michael Berg    gold  1962-08-03 21:29:12  Frauenfeld   todo
2   3      Stephen Vaughn  silver  1983-03-11 11:05:41  St. Gallen   todo
3   4  Cynthia Conigliaro  bronze  1987-09-30 10:22:44      Z체rich   todo
4   5     Beverly Heifner  bronze  1998-01-11 14:13:39       Uster   todo

##### b) Get the count of customers per each status.

In [32]:
#mit der groupby funktion auf die status spalte zugreifen und sie gruppieren, danach mit count zusammenz채hlen.
customers.groupby(['status']).count()

         id  name  bdate  city  canton
status
bronze  326   326    326   326     326
gold    331   331    331   331     331
silver  342   342    342   342     342

##### c) Get the count of customers per each city and check the result. Clean the messy entries and print the result again.

In [33]:
#das gleiche Verfahren wie oben bei den pandas funktionen immer zuerst die Klammer und danach die Spalte in []
customers.groupby(['city']).count()

              id  name  status  bdate  canton
city
Buelach       66    66      66     66      66
B체lach        61    61      61     61      61
Frauenfeld    59    59      59     59      59
Gossau        98    98      98     98      98
Kreuzlingen   74    74      74     74      74
Romanshorn    65    65      65     65      65
Sankt Gallen  86    86      86     86      86
St Gallen     74    74      74     74      74
St. Gallen    79    79      79     79      79
Uster         65    65      65     65      65
Wil           69    69      69     69      69
Winterthur    77    77      77     77      77
Zuerich       62    62      62     62      62
Z체rich        64    64      64     64      64

In [34]:

#Zugriff auf Spalte [] dann mit replac funktion die Werte ersetzen
#inplace = True ist dazu da, um es direkt in der city Spalte zu machen
#mit dem dictionary wird der key Wert zum neuen value Wert ersetzt und das geschieht mit mapping von alten Werten zu neuen Werten
customers['city'].replace({'B체lach':'Buelach', 'St Gallen': 'Sankt Gallen'},inplace = True)
customers['city'].replace({'St. Gallen':'Sankt Gallen', 'Z체rich':'Zuerich'}, inplace = True)

customers.groupby(['city']).count()

C:\Users\chris\AppData\Local\Temp\ipykernel_15568\665562377.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  customers['city'].replace({'B체lach':'Buelach', 'St Gallen': 'Sankt Gallen'},inplace = True)

               id  name  status  bdate  canton
city
Buelach       127   127     127    127     127
Frauenfeld     59    59      59     59      59
Gossau         98    98      98     98      98
Kreuzlingen    74    74      74     74      74
Romanshorn     65    65      65     65      65
Sankt Gallen  239   239     239    239     239
Uster          65    65      65     65      65
Wil            69    69      69     69      69
Winterthur     77    77      77     77      77
Zuerich       126   126     126    126     126

##### d) Add the canton information to the entries and get the count of customers per each status and canton.

In [35]:
customers.groupby(['status', 'canton']).count()

                id  name  bdate  city
status canton
bronze todo    326   326    326   326
gold   todo    331   331    331   331
silver todo    342   342    342   342

In [36]:
zh = ['Buelach', 'Uster', 'Winterthur', 'Zuerich']
tg = ['Frauenfeld', 'Kreuzlingen', 'Romanshorn']
st = ['Wil', 'Sankt Gallen', 'Gossau']

#mit loc werden alle Zeilen und Spalten ausgew채hlt die die Bedingungen erf체llen
#mit isin wird 체berpr체ft ob ein Wert aus city in der Liste zh vorkommt und dann mit True oder False beantwortet und zugewiesen oder nicht
#in den ausgew채hlten Spalten wird Zuerich zugewiesen
customers.loc[customers['city'].isin(zh),'canton'] = 'Zuerich'

customers.loc[customers['city'].isin(tg), 'canton'] = 'Thurgau'

customers.loc[customers['city'].isin(st),'canton'] = 'Sankt Gallen'

In [37]:
customers.groupby(['status', 'canton']).count()

                      id  name  bdate  city
status canton
bronze Sankt Gallen  139   139    139   139
       Thurgau        61    61     61    61
       Zuerich       126   126    126   126
gold   Sankt Gallen  130   130    130   130
       Thurgau        66    66     66    66
       Zuerich       135   135    135   135
silver Sankt Gallen  137   137    137   137
       Thurgau        71    71     71    71
       Zuerich       134   134    134   134

### Task 02: Read the transactions.

##### a) Create a DataFrame called transactions with the transactions.csv file. Print the count of transactions and 5 entries to have a look at the data

In [38]:
transactions = pd.read_csv('DE_Lab05_transactions.csv', delimiter = ',')
transactions.head()

print(transactions['id'].count())

9999

##### b) Get the count of all transactions for the article whiskey.

In [39]:

transactions[transactions['article'] == 'Whiskey']['id'].count()

np.int64(819)

##### c) Get the count of articles per each article.

In [41]:
transactions.groupby(['article']).count()

            id  customer  date  price
article
Beer       846       846   846    846
Burger     830       830   830    830
Chips      865       865   865    865
Coke       805       805   805    805
Fries      790       790   790    790
Gin        859       859   859    859
Guacamole  818       818   818    818
Nachos     850       850   850    850
Pizza      843       843   843    843
Popcorn    840       840   840    840
Tonic      834       834   834    834
Whiskey    819       819   819    819

In [42]:
transactions.groupby(['article'])['id'].count()

article
Beer         846
Burger       830
Chips        865
Coke         805
Fries        790
Gin          859
Guacamole    818
Nachos       850
Pizza        843
Popcorn      840
Tonic        834
Whiskey      819
Name: id, dtype: int64

### Task 03: Doing Analytics.

In [43]:
transactions.head()

   id  customer  article                 date  price
0   1       628  Whiskey  2021-01-14 23:00:02   4.03
1   2       298     Coke  2021-12-29 03:51:24   2.14
2   3       908  Whiskey  2021-11-06 01:40:58   3.67
3   4       325      Gin  2021-05-24 05:51:52   4.46
4   5       242    Tonic  2021-05-17 04:21:13   4.58

##### a) Calculate the sum of all sold articles to the customer with the name 'Beverly Heifner'.

In [44]:

#iloc sucht nach bestimmter position bzw Index also hier 0
transactions[transactions['customer'] == customers[customers['name'] == 'Beverly Heifner']['id'].iloc[0]]['price'].count()

np.int64(15)

##### b) Calculate the sum of all sold articles to customers from the city Uster.

In [46]:
#customers_ids wird die Anzahl Menschen die in Uster leben gez채hlt und gespeichert
customer_ids = customers.loc[customers['city'] == 'Uster', 'id'].values
print(len(customer_ids))
#hier wird mit der loc funktion der Name von Zeile und Spalte ausgew채hlt also Uster
#mit isin bestimmt ob diese spezifischen dabei sind oder nicht
res = transactions.loc[transactions['customer'].isin(customer_ids)].price.sum()
print(res)

65
1931.04

##### c) Calculate the average price of all sold articles to customers from the canton Thurgau.

In [47]:
# mit to_list() = Wenn du die Daten aus einer Spalte oder einer Pandas Serie extrahieren und sie in einer Python-Liste speichern m철chtest.
transactions[transactions['customer'].isin(customers[customers['canton'] == 'Thurgau']['id'].to_list())]['price'].mean()

np.float64(2.9846895507319533)

##### d) Calculate the sum of all sold articles in the month March.

In [51]:


#das data frame bzw die date spalte wird in ein datetime objekt umgewandelt
#das vereinfacht die handhabung und man kann auf einzelne werte zugreifen
#march_rows wird eine liste erstellt die nur m채rz daten hat
transactions['datetime']  = pd.to_datetime(transactions['date'])
march_rows = transactions[transactions['datetime'].dt.month == 3]
res = march_rows.price.sum()
print(res)

2407.74

##### e) Calculate the sum of all sold articles in the month October from customers with the status gold.

In [52]:
#wird wieder mit loc auf die die id und die personen mit status gold zugegriffen und in customer_ids gespeichert 
customer_ids = customers.loc[customers['status'] == 'gold', 'id'].values
# bei res werden die monate oktober gefiltert und geschaut welche in dem monat zur customer_ids liste passen
res = transactions[(transactions['datetime'].dt.month == 10)&(transactions['customer'].isin(customer_ids))].price.sum()
print(res)

969.0200000000001

##### f) Calculate the sum of all sold articles between the hours 21 to 23.

##### g) Calculate the average price of all sold whiskeys to customers born after or in 1980.

##### h) Which month has the highest count of sold whiskeys?

##### i) Which month has the highest amount of sold gins?

##### j) Which is the customer with the highest revenue?

##### k) Which canton has the highest revenue?

### Task 04: Reading
Take your list of the top12 most important and interesting sections of the ebook "97 Things Every Data Engineer Should Know". Read the next top3 sections of your list and write down the most important points of the section with three bullet points each.